[{"snt_id":"G14.2_2884788726_2","term":"content caching","difficulty":1.0,"definition":"Content caching is a performance optimization mechanism in which data is delivered from the closest servers for optimal application performance."},{"snt_id":"G17.2_2893955699_1","term":"logic qubit","difficulty":1.0,"definition":"A logical qubit is a physical or abstract qubit that performs as specified in a quantum algorithm or quantum circuit subject to unitary transformations, has a long enough coherence time to be usable by quantum logic gates"},{"snt_id":"G17.4_2974627365_1","term":"quantum cryptanalysis","difficulty":2.0,"definition":"Quantum cryptanalysis is the study and evaluation of cryptographic algorithms in the presence of a quantum enabled adversary."},{"snt_id":"T19.2_2172121104_3","term":"probabilistic model","difficulty":1.0,"definition":"Probabilistic modeling is a statistical technique used to take into account the impact of random events or actions in predicting the potential occurrence of future outcomes."},{"snt_id":"T15.1_2887855654_7","term":"Ethereum","difficulty":1.0,"definition":"Ethereum is a decentralized, open-source blockchain with smart contract functionality. Ether is the native cryptocurrency of the platform."},{"snt_id":"G07.2_1917985537_2","term":"intrinsic","difficulty":1.0,"definition":"Intrinsic is defined by belonging to a thing by its very nature"},{"snt_id":"T15.1_2952002252_3","term":"resilience","difficulty":1.0,"definition":"resilience testing is a method of software testing that focuses on ensuring that applications will perform well in real-life or chaotic conditions."},{"snt_id":"T15.1_2952002252_1","term":"Penetration tests","difficulty":1.0,"definition":"Penetration testing is a specialized form of security control assessment in which the security assessor assumes the role of an attacker and attempts to overcome the security measures in place intended to safeguard the information system"},{"snt_id":"G07.2_1887815499_7","term":"general framework","difficulty":1.0,"definition":"a framework is a real or conceptual structure intended to serve as a support or guide for the building of something that expands the structure into something useful."},{"snt_id":"T13.3_2134225881_2","term":"Artificial Immune Recognition System","difficulty":2.0,"definition":"Artificial Immune Recognition System is a widely used bio-inspired algorithm that describes the recognition tasks of antigen by memory cells."},{"snt_id":"T13.3_2885975229_3","term":"fuzzy rule","difficulty":1.0,"definition":"Fuzzy rules are used within fuzzy logic systems to infer an output based on input variables"},{"snt_id":"T19.1_2041007121_2","term":"topology hiding policies","difficulty":1.0,"definition":"Topology Hiding involves hiding topology-related information in messages sent from a Protected Network to an Untrusted Network, as well as restoring the topology-related information in messages from an Untrusted Network."},{"snt_id":"G17.4_2298554870_1","term":"mutltiqubit","difficulty":1.0,"definition":"A multi-qubit system is a collection of multiple qubits, treated as a single system."},{"snt_id":"G14.2_2611788902_1","term":"Quality-to-Experience","difficulty":1.0,"definition":"Quality-to-Experience is the overall acceptability of an application or service, as perceived subjectively by the end-user."},{"snt_id":"T16.3_2230023062_1","term":"domain name system","difficulty":1.0,"definition":"The domain name system (DNS) is a naming database in which internet domain names are located and translated into Internet Protocol (IP) addresses."},{"snt_id":"G17.2_2040411766_6","term":"qubit qutrit","difficulty":2.0,"definition":"A qutrit (or quantum trit) is a unit of quantum information that is realized by a 3-level quantum system, that may be in a superposition of three mutually orthogonal quantum states"},{"snt_id":"G17.2_2099103563_1","term":"quantum teleportation","difficulty":1.0,"definition":"a quantum information protocol by which the unknown quantum state of one particle can be transferred to another distant particle, using a pair of entangled particles, a projective measurement, and exchange of two bits of classical information"},{"snt_id":"G17.1_2042591812_2","term":"QCA","difficulty":2.0,"definition":"A quantum cellular automaton (QCA) is an abstract model of quantum computation, devised in analogy to conventional models of cellular automata. quantum cellular automaton refers to the merger of elements of both (1) the study of cellular automata in conventional computer science and (2) the study of quantum information processing"},{"snt_id":"G17.4_2328341797_7","term":"quantum correlation","difficulty":1.0,"definition":"Entanglement, or quantum correlation, is one of the central concepts in quantum information theory. Its theory can be roughly separated into three parts: qualitative, comparative, and quantitative."},{"snt_id":"G14.2_3000868545_1","term":"encryption solutions","difficulty":1.0,"definition":"A data encryption solution is a software system that employs data encryption algorithms to protect sensitive data, combined with management tools for deploying and monitoring data encryption across an organization"},{"snt_id":"T15.2_2012614298_5","term":"plaintext","difficulty":1.0,"definition":"In cryptography, plaintext is usually ordinary readable text before it is encrypted into ciphertext, or readable text after it is decrypted."},{"snt_id":"T13.3_2551429935_7","term":"majority class","difficulty":1.0,"definition":"the class with the highest number of samples in the dataset"},{"snt_id":"T16.3_2230023062_1","term":"dns cache poisoning","difficulty":1.0,"definition":"Domain Name Server (DNS) cache poisoning is an attack in which altered DNS records are used to redirect online traffic to a fraudulent website that resembles its intended destination."},{"snt_id":"G18.2_2554589817_6","term":"differential privacy model","difficulty":1.0,"definition":"differential privacy is a privacy mechanism that ensures that the removal or addition of a single database item does not (substantially) affect the outcome of any analysis"},{"snt_id":"T16.2_1760039095_3","term":"three-party key exchange","difficulty":1.0,"definition":"Three-party authentication key exchange (3PAKE) is a protocol that allows two users to set up a common session key with the help of a trusted remote server, which is effective for secret communication between clients in a large-scale network environment"},{"snt_id":"G07.2_1917985537_4","term":"controversies","difficulty":1.0,"definition":"controversy is a disagreement, often a public one, that involves different ideas or opinions about something"},{"snt_id":"T13.3_2166739810_4","term":"generalization performance","difficulty":1.0,"definition":"The generalization performance of any learner is quantified by the difference between the training error and the test error. Good learners are those where the test error and the training error have close values."},{"snt_id":"T19.1_2761355172_2","term":"qos routing","difficulty":1.0,"definition":"A routing mechanism that encompasses finding and selection of cost-effective paths for IP traffic flows that may assure the required QoS level relying on the information of network resource availability."},{"snt_id":"G07.2_1887815499_4","term":"entropy value","difficulty":1.0,"definition":"Entropy is a measure of self information or uncertainty"},{"snt_id":"G17.1_2962706423_4","term":"memory addressing","difficulty":1.0,"definition":"A memory address is a unique identifier used by a device or CPU for data tracking. This binary address is defined by an ordered and finite sequence allowing the CPU to track the location of each memory byte."},{"snt_id":"G14.2_2722360008_5","term":"user bases","difficulty":1.0,"definition":"user base for a product is the number of people who use product or service"},{"snt_id":"G14.2_2178173146_9","term":"user experience","difficulty":1.0,"definition":"user experience is recognized within the context of graphic interface and web design, as a way to measure the degree of impact on the end user."},{"snt_id":"T16.2_2144748689_4","term":"Rabin cryptosystem","difficulty":2.0,"definition":"The Rabin cryptosystem is a family of public-key encryption schemes based on a trapdoor function whose security, like that of RSA, is related to the difficulty of integer factorization"},{"snt_id":"G17.1_1999767563_3","term":"p-type","difficulty":2.0,"definition":"A p-type semiconductor is a material that conducts, with positive holes being the majority charge carriers."},{"snt_id":"G17.4_2524344971_1","term":"quantum entanglement","difficulty":1.0,"definition":"Quantum entanglement is a phenomenon in which the quantum states of two or more objects become correlated, meaning that the state of one object can affect the state of the other(s) even if the objects are separated by large distances."},{"snt_id":"G17.1_1985674454_4","term":"Power-Delay Product","difficulty":2.0,"definition":"In digital electronics, the power–delay product (PDP) is a figure of merit correlated with the energy efficiency of a logic gate or logic family"},{"snt_id":"G14.2_2088744588_2","term":"geolocation","difficulty":1.0,"definition":"geolocation is the geographical location (both longitudinal and latitudinal) of an Internet-connect device, such as a cell phone or tablet"},{"snt_id":"G14.2_2611788902_2","term":"packet loss","difficulty":1.0,"definition":"packet loss is the total percentage of the packets of data that don’t make it to or from each party in the communication."},{"snt_id":"G07.2_170316166_2","term":"chemtrails","difficulty":1.0,"definition":"chemtrails is a conspiracy theory which holds that airplanes deliberately release chemicals that stupefy the public"},{"snt_id":"G14.2_3000868545_1","term":"forwarding","difficulty":1.0,"definition":"Forwarding nodes broadcast encoded packets generated using either native packets received by the source or other encoded packets received by neighbor nodes."},{"snt_id":"G17.2_2012719958_1","term":"pure states","difficulty":2.0,"definition":"A pure state is the quantum state where we have exact information about the quantum system."},{"snt_id":"G17.1_2094810688_2","term":"interactive environments","difficulty":1.0,"definition":"It is any technology-based interface that reacts and responds to user input. An Interactive environment is the broad term used to categorize forms of computer-based media that instructs, communicates, and entertains as a result of user action."},{"snt_id":"T13.3_2052300809_5","term":"naive bayes","difficulty":2.0,"definition":"Naive Bayes methods are a set of supervised learning algorithms based on applying Bayes' theorem with the “naive” assumption of conditional independence between every pair of features given the value of the class variable."},{"snt_id":"T16.2_2144748689_2","term":"server impersonation","difficulty":1.0,"definition":"server impersonation is when a server can run protocols under the client's user account instead of the server account."},{"snt_id":"G17.2_2040411766_1","term":"Dzyaloshinskii---Moriya (DM) interaction","difficulty":2.0,"definition":"antisymmetric exchange, also known as the Dzyaloshinskii–Moriya interaction (DMI), is a contribution to the total magnetic exchange interaction between two neighboring magnetic spins,"},{"snt_id":"T15.2_2998344819_1","term":"Pattern lock","difficulty":1.0,"definition":"Pattern Lock is a security measure that protects devices, such as mobile phones or tablets, and which is preferred by many to PIN codes or text passwords."},{"snt_id":"G17.4_2524344971_1","term":"quadratic","difficulty":1.0,"definition":"the term quadratic describes something that pertains to squares, to the operation of squaring, to terms of the second degree, or equations or formulas that involve such terms."},{"snt_id":"T15.2_2012955216_3","term":"support vector machines","difficulty":2.0,"definition":"Support vector machines (SVMs) are a set of related supervised learning methods, which are popular for performing classification and regression analysis using data analysis and pattern recognition. Methods vary on the structure and attributes of the classifier. The most commonly known SVM is a linear classifier, predicting each input’s member class between two possible classifications"},{"snt_id":"G17.1_2070615909_1","term":"quantum computation","difficulty":1.0,"definition":"Quantum computing aims at outperforming classical computers for some specific calculations. It relies on the additional resource given by the qubit superposition states, which can be used to design more efficient algorithms"},{"snt_id":"T13.3_2944188749_4","term":"F-value","difficulty":1.0,"definition":"The F-test is used in regression analysis to test the hypothesis that all model parameters are zero. It is also used in statistical analysis when comparing statistical models that have been fitted using the same underlying factors and data set to determine the model with the best fit."},{"snt_id":"T16.2_1760039095_3","term":"S-3PAKE","difficulty":2.0,"definition":"Three-party authentication key exchange (3PAKE) is a protocol that allows two users to set up a common session key with the help of a trusted remote server, which is effective for secret communication between clients in a large-scale network environment"},{"snt_id":"T19.1_3004282241_1","term":"tmss","difficulty":1.0,"definition":"Traffic monitoring, also known as network monitoring, is the method of studying the incoming and outgoing traffic on a computer network via specialized hardware and\/or software"},{"snt_id":"T19.1_1446507644_1","term":"network topologies","difficulty":1.0,"definition":"The network topology describes the way the communication is structured within a network."},{"snt_id":"G14.2_2611788902_5","term":"impairments","difficulty":1.0,"definition":"the state or fact of a faculty or function being weakened or damaged."},{"snt_id":"T15.2_2012614298_1","term":"synchronous stream cipher","difficulty":2.0,"definition":"Stream ciphers are a type of encryption algorithm that process an individual bit, byte, or character of plaintext at a time. Stream ciphers are often faster than block ciphers in hardware and require circuitry that is less complex."},{"snt_id":"G14.2_2293424065_2","term":"seminal","difficulty":1.0,"definition":"Seminal works, sometimes called pivotal or landmark studies, are the initial pieces that presented an important or influential idea within a particular discipline"},{"snt_id":"G17.1_2070615909_3","term":"propagating","difficulty":1.0,"definition":"Wave propagation is any of the ways in which waves travel"},{"snt_id":"T16.3_2043982660_1","term":"low-rate DoS attack","difficulty":1.0,"definition":"A Low and Slow DDoS attack, also known as a slow-rate attack, involves what appears to be legitimate traffic at a very slow rate. This type of state exhaustion DDoS attack targets application and server resources and is difficult to distinguish from normal traffic."},{"snt_id":"T13.3_2075267337_3","term":"meta-technique","difficulty":1.0,"definition":"In the context of machine learning, meta-learning refers to the application of machine learning algorithms for the optimization and training of machine learning models."},{"snt_id":"T19.1_1446507644_7","term":"cloud tenants","difficulty":1.0,"definition":"A cloud tenant is a customer who purchases cloud computing resources. This could be an individual user, a group of users, or an entire department or company."},{"snt_id":"T13.3_2052300809_6","term":"minority class","difficulty":1.0,"definition":"the class with the lowest number of samples in the (training) dataset"},{"snt_id":"T13.3_2166739810_1","term":"Semantic scene classification","difficulty":2.0,"definition":"The objective of scene classification is to segment and classify different regions in the image whereas place recognition assigns a single category to the entire image"},{"snt_id":"G17.1_2042591812_2","term":"quantum dot","difficulty":2.0,"definition":"Quantum dots (QDs) are semiconductor nanocrystals in the size range 1–10 nm in diameter and widely used for imaging (diagnosis) and targeted delivery purposes"},{"snt_id":"G17.2_2040411766_7","term":"negativity measure","difficulty":1.0,"definition":"Quantum negativity is a measure of quantum entanglement. An experiment whose explanation requires negative probabilities is said to possess ‘quantum negativity.’ The scientists have now shown that this quantum negativity can help take more precise measurements."},{"snt_id":"T15.1_2886610424_3","term":"hash functions","difficulty":1.0,"definition":"A hash function is a computational method that can map an indeterminate size of data into a fixed size of data. Or more plainly, it provides a number quantity that represents the input data."},{"snt_id":"G14.2_2611788902_3","term":"qos metrics","difficulty":1.0,"definition":"QoS metrics refer to objective, system-related characteristics that provide insight into the performance of the delivery service at the network\/transmission level"},{"snt_id":"T15.2_2012614298_1","term":"shift registers","difficulty":2.0,"definition":"A shift register is a sequential logic device which consists of a cascade of Flip-Flops. The output of each Flip-Flop in the cascade is connected to the input of the succeeding Flip-Flop, and data can be shifted from left to right or vice versa by the clock which is frequently referred to as the shift pulse."},{"snt_id":"T15.2_2782830553_1","term":"Hash-based message authentication code","difficulty":2.0,"definition":"Hash-based Message Authentication Code (HMAC) is a message authentication code that uses a cryptographic key in conjunction with a hash function. Hash-based message authentication code (HMAC) provides the server and the client each with a private key that is known only to that specific server and that specific client."},{"snt_id":"T15.1_2887855654_5","term":"maas ecosystems","difficulty":2.0,"definition":"Mobility as a service (MaaS) is a type of service that, through a joint digital channel, enables users to plan, book, and pay for multiple types of mobility services"},{"snt_id":"T19.1_2761355172_1","term":"NP-hard problem","difficulty":2.0,"definition":"In computational complexity theory, NP-hardness is the defining property of a class of problems that are informally \"at least as hard as the hardest problems in NP\""},{"snt_id":"G17.2_2893955699_2","term":"logic qubit","difficulty":1.0,"definition":"A logical qubit is a physical or abstract qubit that performs as specified in a quantum algorithm or quantum circuit subject to unitary transformations, has a long enough coherence time to be usable by quantum logic gates"},{"snt_id":"G17.4_2974627365_5","term":"quantum cryptanalysis","difficulty":2.0,"definition":"Quantum cryptanalysis is the study and evaluation of cryptographic algorithms in the presence of a quantum enabled adversary."},{"snt_id":"G17.4_2974627365_6","term":"quantum cryptanalysis","difficulty":2.0,"definition":"Quantum cryptanalysis is the study and evaluation of cryptographic algorithms in the presence of a quantum enabled adversary."},{"snt_id":"T19.2_2172121104_7","term":"probabilistic model","difficulty":1.0,"definition":"Probabilistic modeling is a statistical technique used to take into account the impact of random events or actions in predicting the potential occurrence of future outcomes."},{"snt_id":"T13.3_2885975229_4","term":"fuzzy rule","difficulty":1.0,"definition":"Fuzzy rules are used within fuzzy logic systems to infer an output based on input variables"},{"snt_id":"T15.2_2997106804_3","term":"plaintext","difficulty":1.0,"definition":"In cryptography, plaintext is usually ordinary readable text before it is encrypted into ciphertext, or readable text after it is decrypted."},{"snt_id":"T13.3_2052300809_6","term":"majority class","difficulty":1.0,"definition":"the class with the highest number of samples in the dataset"},{"snt_id":"T13.3_2944188749_3","term":"majority class","difficulty":1.0,"definition":"the class with the highest number of samples in the dataset"},{"snt_id":"T16.2_1760039095_1","term":"three-party key exchange","difficulty":1.0,"definition":"Three-party authentication key exchange (3PAKE) is a protocol that allows two users to set up a common session key with the help of a trusted remote server, which is effective for secret communication between clients in a large-scale network environment"},{"snt_id":"T16.2_1760039095_11","term":"three-party key exchange","difficulty":1.0,"definition":"Three-party authentication key exchange (3PAKE) is a protocol that allows two users to set up a common session key with the help of a trusted remote server, which is effective for secret communication between clients in a large-scale network environment"},{"snt_id":"G17.1_1999767563_4","term":"Power-Delay Product","difficulty":2.0,"definition":"In digital electronics, the power–delay product (PDP) is a figure of merit correlated with the energy efficiency of a logic gate or logic family"},{"snt_id":"G07.2_2953000449_2","term":"chemtrails","difficulty":1.0,"definition":"chemtrails is a conspiracy theory which holds that airplanes deliberately release chemicals that stupefy the public"},{"snt_id":"G17.2_2952201711_1","term":"pure states","difficulty":2.0,"definition":"A pure state is the quantum state where we have exact information about the quantum system."},{"snt_id":"T13.3_2052300809_9","term":"naive bayes","difficulty":2.0,"definition":"Naive Bayes methods are a set of supervised learning algorithms based on applying Bayes' theorem with the “naive” assumption of conditional independence between every pair of features given the value of the class variable."},{"snt_id":"G17.1_2998842053_1","term":"quantum computation","difficulty":1.0,"definition":"Quantum computing aims at outperforming classical computers for some specific calculations. It relies on the additional resource given by the qubit superposition states, which can be used to design more efficient algorithms"},{"snt_id":"G17.1_2480433103_6","term":"quantum computation","difficulty":1.0,"definition":"Quantum computing aims at outperforming classical computers for some specific calculations. It relies on the additional resource given by the qubit superposition states, which can be used to design more efficient algorithms"},{"snt_id":"T16.2_1760039095_5","term":"S-3PAKE","difficulty":2.0,"definition":"Three-party authentication key exchange (3PAKE) is a protocol that allows two users to set up a common session key with the help of a trusted remote server, which is effective for secret communication between clients in a large-scale network environment"},{"snt_id":"T16.3_2043982660_4","term":"low-rate DoS attack","difficulty":1.0,"definition":"A Low and Slow DDoS attack, also known as a slow-rate attack, involves what appears to be legitimate traffic at a very slow rate. This type of state exhaustion DDoS attack targets application and server resources and is difficult to distinguish from normal traffic."},{"snt_id":"T13.3_2551429935_7","term":"minority class","difficulty":1.0,"definition":"the class with the lowest number of samples in the (training) dataset"},{"snt_id":"T15.1_2886610424_4","term":"hash functions","difficulty":1.0,"definition":"A hash function is a computational method that can map an indeterminate size of data into a fixed size of data. Or more plainly, it provides a number quantity that represents the input data."},{"snt_id":"T15.1_2886610424_5","term":"hash functions","difficulty":1.0,"definition":"A hash function is a computational method that can map an indeterminate size of data into a fixed size of data. Or more plainly, it provides a number quantity that represents the input data."},{"snt_id":"T15.1_2887855654_3","term":"maas ecosystems","difficulty":2.0,"definition":"Mobility as a service (MaaS) is a type of service that, through a joint digital channel, enables users to plan, book, and pay for multiple types of mobility services"},{"snt_id":"G05.1_2117924928_2","term":"sgRNA","difficulty":2.0,"definition":"single guide RNA"},{"snt_id":"G05.1_2914002216_1","term":"CRISPR","difficulty":2.0,"definition":"Clustered regularly interspaced short palindromic repeats"},{"snt_id":"G05.2_2796443924_4","term":"CRISPR","difficulty":2.0,"definition":"Clustered regularly interspaced short palindromic repeats"},{"snt_id":"G05.2_2796443924_2","term":"gRNA","difficulty":2.0,"definition":"guide RNA"},{"snt_id":"G05.2_2796443924_3","term":"gRNA","difficulty":2.0,"definition":"guide RNA"},{"snt_id":"G05.2_2796443924_4","term":"gRNA","difficulty":2.0,"definition":"guide RNA"},{"snt_id":"G05.2_2796443924_3","term":"SVM","difficulty":2.0,"definition":"support vector machines"},{"snt_id":"G06.2_2548923997_2","term":"VANET","difficulty":2.0,"definition":"vehicular ad-hoc network"},{"snt_id":"G06.2_2548923997_4","term":"VANET","difficulty":2.0,"definition":"vehicular ad-hoc network"},{"snt_id":"G06.2_2548923997_5","term":"BP","difficulty":2.0,"definition":"business performance"},{"snt_id":"G06.2_2548923997_5","term":"IDS","difficulty":2.0,"definition":"intrusion detection systems"},{"snt_id":"G06.2_2906897310_4","term":"CNN","difficulty":2.0,"definition":"cellular neural\/nonlinear network"},{"snt_id":"G06.2_2931522054_1","term":"MATLAB","difficulty":2.0,"definition":"matrix laboratory"},{"snt_id":"G06.2_2931522054_3","term":"MATLAB","difficulty":2.0,"definition":"matrix laboratory"},{"snt_id":"G06.2_2931522054_4","term":"MATLAB","difficulty":2.0,"definition":"matrix laboratory"},{"snt_id":"G06.2_2931522054_5","term":"MATLAB","difficulty":2.0,"definition":"matrix laboratory"},{"snt_id":"G06.2_2931522054_6","term":"MATLAB","difficulty":2.0,"definition":"matrix laboratory"},{"snt_id":"G06.2_2931522054_7","term":"MATLAB","difficulty":2.0,"definition":"matrix laboratory"},{"snt_id":"G06.2_2935172463_1","term":"MATLAB","difficulty":2.0,"definition":"matrix laboratory"},{"snt_id":"G06.2_2935172463_4","term":"MATLAB","difficulty":2.0,"definition":"matrix laboratory"},{"snt_id":"G06.2_2931522054_2","term":"ROS","difficulty":2.0,"definition":"Robot Operating System"},{"snt_id":"G06.2_2931522054_4","term":"ROS","difficulty":2.0,"definition":"Robot Operating System"},{"snt_id":"G06.2_2931522054_5","term":"ROS","difficulty":2.0,"definition":"Robot Operating System"},{"snt_id":"G06.2_2931522054_7","term":"ROS","difficulty":2.0,"definition":"Robot Operating System"},{"snt_id":"G06.2_2935172463_1","term":"ROS","difficulty":2.0,"definition":"Robot Operating System"},{"snt_id":"G06.2_2935172463_2","term":"ROS","difficulty":2.0,"definition":"Robot Operating System"},{"snt_id":"G06.2_2935172463_3","term":"ROS","difficulty":2.0,"definition":"Robot Operating System"},{"snt_id":"G06.2_2935172463_4","term":"ROS","difficulty":2.0,"definition":"Robot Operating System"},{"snt_id":"G07.1_2239526842_1","term":"OSN","difficulty":2.0,"definition":"online social networks"},{"snt_id":"G07.1_2239526842_2","term":"OSN","difficulty":2.0,"definition":"online social networks"},{"snt_id":"G08.2_1607424157_3","term":"NCI","difficulty":2.0,"definition":"National Cancer Institute"},{"snt_id":"G09.1_2921035272_3","term":"IoT","difficulty":2.0,"definition":"Internet of Things"},{"snt_id":"G09.1_2921035272_4","term":"IoT","difficulty":2.0,"definition":"Internet of Things"},{"snt_id":"G09.1_2921035272_7","term":"IoT","difficulty":2.0,"definition":"Internet of Things"},{"snt_id":"G09.1_2921035272_8","term":"IoT","difficulty":2.0,"definition":"Internet of Things"},{"snt_id":"G10.1_2968701259_1","term":"CPU","difficulty":1.0,"definition":"central processing unit"},{"snt_id":"G11.1_2794850674_3","term":"HTS","difficulty":2.0,"definition":"High-throughput sequence"},{"snt_id":"G13.1_2570453702_2","term":"ICT","difficulty":2.0,"definition":"Information and Communication technology"},{"snt_id":"G13.1_2570453702_5","term":"ICT","difficulty":2.0,"definition":"Information and Communication technology"},{"snt_id":"G13.1_2570453702_6","term":"ICT","difficulty":2.0,"definition":"Information and Communication technology"},{"snt_id":"G13.1_3004169763_2","term":"AHP","difficulty":2.0,"definition":"Analytic Hierarchy Process"},{"snt_id":"T15.1_2556484769_1","term":"Honeypot","difficulty":2.0,"definition":"A honeypot is a system designed to attract attackers. This allows information security researchers and network defenders to better analyze network-based attacks. A honeynet is a (real or simulated) network of honeypots. Honeypots have no production value beyond research"},{"snt_id":"T15.1_2952002252_4","term":"pentesting framework","difficulty":1.0,"definition":"The Penetration Testing Framework (PTF) provides comprehensive hands-on penetration testing guide. It also lists usages of the security testing tools in each testing category."},{"snt_id":"G17.1_1999767563_1","term":"logic functions","difficulty":1.0,"definition":"A computer switching circuit that consists of a number of logic gates and performs logical operations on data."},{"snt_id":"T13.3_2551429935_1","term":"Deep learning","difficulty":1.0,"definition":"Deep learning is a subclass of machine learning. It imitates the function of the human brain to interpret data using multi-layered neural networks"},{"snt_id":"G17.1_2094810688_3","term":"X3D","difficulty":2.0,"definition":"X3D is an ISO-ratified, file format and run-time architecture to represent and communicate 3D scenes and objects. · X3D fully represents 3-dimensional data."},{"snt_id":"G14.2_2615924707_5","term":"user study","difficulty":1.0,"definition":"User study focuses on understanding user behaviors, needs, and motivations through observation techniques, task analysis, and other feedback methodologies."},{"snt_id":"G14.2_2722360008_2","term":"telegram","difficulty":1.0,"definition":"Telegram Messenger is a globally accessible freemium, cross-platform, encrypted, cloud-based and centralized instant messaging service."},{"snt_id":"G14.2_1996608491_1","term":"cryptographic keys","difficulty":1.0,"definition":"A cryptographic key is a string of binary numbers used for encrypting and decrypting information which is essnetial for security reasons"},{"snt_id":"G14.2_2178173146_4","term":"encryption software","difficulty":1.0,"definition":"Encryption software is software that uses cryptography to prevent unauthorized access to digital information"},{"snt_id":"T19.2_2127644869_2","term":"paralell genetic algorithm","difficulty":2.0,"definition":"The parallel genetic algorithm (PGA) is a prototype of a new kind of a distributed algorithm. It is based on a parallel search by individuals all of which have the complete problem description. The information exchange between the individuals is done by simulating biological principles of evolution."},{"snt_id":"T19.2_2172121104_8","term":"real-coded EDA","difficulty":2.0,"definition":"The Estimation of Distribution Algorithms are a class of evolutionary algorithms which adopt probabilistic models to reproduce the genetic information of the next generation, instead of conventional crossover and mutation operations"},{"snt_id":"T19.2_1981298165_3","term":"mutation operator","difficulty":2.0,"definition":"Mutation is a genetic operator used to maintain genetic diversity of the chromosomes of a population of a genetic or, more generally, an evolutionary algorithm (EA)"},{"snt_id":"G17.2_2040411766_3","term":"DM interaction","difficulty":2.0,"definition":"antisymmetric exchange, also known as the Dzyaloshinskii–Moriya interaction (DMI), is a contribution to the total magnetic exchange interaction between two neighboring magnetic spins,"},{"snt_id":"T19.1_1446507644_5","term":"ethernet switches","difficulty":1.0,"definition":"An Ethernet switch is a type of network hardware that is foundational to networking and the internet. Ethernet switches connect cabled devices, like computers and servers, in an Ethernet LAN so they can communicate with each other and to the internet."},{"snt_id":"T15.1_2886610424_4","term":"M-D type","difficulty":2.0,"definition":"the Merkle–Damgård (M-D) construction or Merkle–Damgård hash function is a method of building collision-resistant cryptographic hash functions from collision-resistant one-way compression functions. This construction was used in the design of many popular hash algorithms such as MD5, SHA-1 and SHA-2"},{"snt_id":"T19.2_1981298165_1","term":"software test data","difficulty":1.0,"definition":"data created or selected to satisfy the execution preconditions and inputs to execute one or more test cases"},{"snt_id":"G17.1_2998842053_3","term":"quantum computers","difficulty":1.0,"definition":"a quantum computer is radically different from a digital computer. In particular, it is based on quantum logic gates. In principle, a quantum computer can perform every task that a digital computer can. However, there are some specialized tasks for which a quantum computer is much, much faster than a digital computer. Two such tasks are factoring of large numbers and data base searches."},{"snt_id":"T16.2_2784826804_8","term":"Diffie-Helman key exchange","difficulty":2.0,"definition":"Diffie–Hellman key exchange is a mathematical method of securely exchanging cryptographic keys over a public channel and was one of the first public-key protocols as conceived by Ralph Merkle and named after Whitfield Diffie and Martin Hellman."},{"snt_id":"T15.2_2572945594_10","term":"parallel computing cores","difficulty":1.0,"definition":"Parallel computing refers to the process of breaking down larger problems into smaller, independent, often similar parts that can be executed simultaneously by multiple processors communicating via shared memory, the results of which are combined upon completion as part of an overall algorithm."},{"snt_id":"T19.2_1566614675_2","term":"prediction functions","difficulty":1.0,"definition":"a prediction function is a mathematical function that tells you something about a future event, based on past events"},{"snt_id":"T19.2_1566614675_1","term":"classifier prediction","difficulty":1.0,"definition":"Classification is the process of identifying which category a new observation belongs to based on a training data set containing observations whose category membership is known"},{"snt_id":"G17.2_2012719958_4","term":"N-tangle","difficulty":1.0,"definition":"an n-tangle is a proper embedding of the disjoint union of n arcs into a 3-ball; the embedding must send the endpoints of the arcs to 2n marked points on the ball's boundary."},{"snt_id":"T19.1_2041007121_3","term":"network maps","difficulty":1.0,"definition":"A network map is a visual representation of devices in the network, their interconnections, and the transport layers that provide network services."},{"snt_id":"G18.2_2038052523_8","term":"Waisda","difficulty":1.0,"definition":"The Waisda? video labeling game is a crowsourcing tool to collect user-generated metadata for video clips."},{"snt_id":"T15.2_2158296297_1","term":"meet-in-the-middle attack","difficulty":1.0,"definition":"Meet-in-the-middle is a classical technique of cryptanalysis which applies to many constructions. The idea is that the attacker constructs patterns that propagate from both ends to the middle of the cipher, in some cases by partial key-guessing"},{"snt_id":"G17.1_2070615909_1","term":"2-dimensional","difficulty":null,"definition":"A two-dimensional (2D) shape can be defined as a flat figure or a shape that has two dimensions—length and width."},{"snt_id":"T19.1_187863002_1","term":"traffic engineering","difficulty":1.0,"definition":"Traffic engineering (TE) is a process whereby a network operator can engineer the paths used to carry traffic flows that vary from those chosen automatically by the routing protocol(s) in use in that same network"},{"snt_id":"G17.1_2962706423_5","term":"HPC","difficulty":1.0,"definition":"High performance computing (HPC) is the ability to process data and perform complex calculations at high speeds"},{"snt_id":"G17.1_1502166895_1","term":"cliques","difficulty":2.0,"definition":"a clique is a subset of vertices of an undirected graph such that every two distinct vertices in the clique are adjacent."},{"snt_id":"T16.2_1760039095_1","term":"key exchange protocol","difficulty":1.0,"definition":"Key exchange is a method in cryptography by which cryptographic keys are exchanged between two parties, allowing use of a cryptographic algorithm."},{"snt_id":"G17.2_2099103563_3","term":"qubit teleportation","difficulty":1.0,"definition":"Quantum teleportation is a technique for transferring quantum information from a sender at one location to a receiver some distance away."},{"snt_id":"T15.1_1576337284_5","term":"embedding","difficulty":1.0,"definition":"Embedding is the process of converting high-dimensional data to low-dimensional data in the form of a vector in such a way that the two are semantically similar."},{"snt_id":"G17.1_2962706423_3","term":"cisc architectures","difficulty":2.0,"definition":"A complex instruction set computer (CISC) is a computer architecture in which single instructions can execute several low-level operations (such as a load from memory, an arithmetic operation, and a memory store) or are capable of multi-step operations or addressing modes within single instructions."},{"snt_id":"G17.4_2298554870_1","term":"dynamical decoupling pulses","difficulty":2.0,"definition":"Dynamical decoupling (DD) is a technique for preserving the coherence of quantum mechanical states in the presence of a noisy environment"},{"snt_id":"T16.3_2163051406_3","term":"testbeds","difficulty":1.0,"definition":"Testbeds are composite abstractions of systems and are used to study system components and interactions to gain further insight into the essence of the real system."},{"snt_id":"G17.4_2298554870_1","term":"DDPs","difficulty":2.0,"definition":"Dynamical decoupling (DD) is a technique for preserving the coherence of quantum mechanical states in the presence of a noisy environment"},{"snt_id":"T19.2_2151579207_1","term":"immune genetic algorithm","difficulty":2.0,"definition":"Immune genetic algorithm is an improved genetic algorithm which combines immune operator and traditional genetic algorithm"},{"snt_id":"G17.1_2094810688_3","term":"vrml","difficulty":2.0,"definition":"Virtual Reality Modeling Language (VRML) is a standard file format for representing 3-dimensional interactive vector graphics, designed particularly with the World Wide Web in mind. It has been superseded by X3D."},{"snt_id":"T16.2_2023008838_1","term":"impersonation attacks","difficulty":1.0,"definition":"An impersonation attack is a type of targeted phishing attack where a malicious actor pretends to be someone else or other entities to steal sensitive data from unsuspecting employees using social engineering tactics."},{"snt_id":"G17.2_2893955699_2","term":"C-GHZ state","difficulty":2.0,"definition":"Greenberger–Horne–Zeilinger state (GHZ state) is a certain type of entangled quantum state that involves at least three subsystems (particle states, qubits, or qudits)."},{"snt_id":"T19.1_2041007121_6","term":"network management","difficulty":1.0,"definition":"Network management is providing functions to control, plan, allocate, deploy, coordinate, and monitor network resources"},{"snt_id":"T13.3_2944188749_1","term":"hybrid sampling","difficulty":1.0,"definition":"hybrid sampling uses a combination of two sampling techniques to create a balanced dataset for use in training machine learning models"},{"snt_id":"T13.3_2166739810_2","term":"neural net","difficulty":1.0,"definition":"Neural networks are machine learning models that are inspired by the biological neural networks of animals, where, as the name suggests, the model is a network of simpler models, each of which corresponds loosely to a biological neuron that is connected to and can transmit signals with other neurons."},{"snt_id":"T13.3_2075267337_4","term":"data boosting","difficulty":1.0,"definition":"Boosting is an ensemble learning method that combines a set of weak learners into strong learners to minimize training errors. In boosting, a random sample of data is selected, fitted with a model, and then trained sequentially. That is, each model tries to compensate for the weaknesses of its predecessor"},{"snt_id":"G17.1_1999767563_2","term":"SPICE","difficulty":2.0,"definition":"A SPICE model is a text-description of a circuit component used by the SPICE Simulator to mathematically predict the behavior of that part under varying conditions"},{"snt_id":"T13.3_2294656858_1","term":"Associative Classification","difficulty":1.0,"definition":"Associative classification is a branch of data mining research that combines association rule mining with classification. Associative classification is a special case of association rule discovery in which only the class attribute is considered on the rule's right-hand side (consequent)"},{"snt_id":"G17.1_2094810688_1","term":"game level editor","difficulty":1.0,"definition":"A video game level editor creates the interactive architecture for video games, including the landscape, buildings and objects."},{"snt_id":"G17.2_2012719958_2","term":"linear entropy","difficulty":1.0,"definition":"The linear entropy is a measure of mixedness in quantum states. Its main feature is that it is easy to compute."},{"snt_id":"T15.2_2279843864_1","term":"ic cards","difficulty":1.0,"definition":"An integrated circuit card, or chip card, is a payment card that uses an embedded microchip to store data in addition to (or instead of) a traditional magnetic stripe."},{"snt_id":"T15.1_2952002252_7","term":"human pentesting","difficulty":1.0,"definition":"human pentesting is a manual process executed by humans with diverse and specialized skill sets. A pen tester will use tools as a part of their work, but they apply their human ingenuity to exploit vulnerabilities and illustrate what an attacker might be capable of when targeting a particular system."},{"snt_id":"G17.4_2524344971_4","term":"entangled state","difficulty":1.0,"definition":"An entangled state of a composite system is a state that cannot be written as a product state of the component systems."},{"snt_id":"G17.1_1502166895_5","term":"partitioning","difficulty":1.0,"definition":"A graph partition is the reduction of a graph to a smaller graph by partitioning its set of nodes into mutually exclusive groups."},{"snt_id":"T19.1_2064840401_7","term":"cross layer","difficulty":1.0,"definition":"Cross-layer optimization in networks refers to obtaining enhanced network performance by exploiting the information across layers of the networking stack."},{"snt_id":"G14.2_2293424065_6","term":"mental models","difficulty":1.0,"definition":"A user's mental model is a conceptualization or internal explanation each user has built about how a particular system works"},{"snt_id":"T19.2_1978514531_7","term":"orders of magnitude","difficulty":1.0,"definition":"Order of magnitude refers to the class of scale of any numerical value in which each class contains values of a fixed ratio to the class before it"},{"snt_id":"G17.4_2314409663_1","term":"quibit system","difficulty":2.0,"definition":"A qubit is a two-state (or two-level) quantum-mechanical system, one of the simplest quantum systems displaying the peculiarity of quantum mechanics."},{"snt_id":"G17.1_1502166895_2","term":"Helly property","difficulty":2.0,"definition":"This is a graph property which is named after the Austrian mathematician Eduard Helly. Helly showed that whenever every d+1 sets of a collection of convex sets in Rd have nonempty intersection, then the total intersection of these sets must be nonempty too."},{"snt_id":"T19.1_2139158116_4","term":"network simulator-3","difficulty":1.0,"definition":"network simulator-3 is a discrete-event network simulator, targeted primarily for research and educational use."},{"snt_id":"G17.1_2042591812_3","term":"and-or gates","difficulty":1.0,"definition":"An AND\/OR gate is a logic circuit that performs the AND\/OR operations on the circuit's input."},{"snt_id":"T19.2_2172121104_4","term":"selection pressure","difficulty":1.0,"definition":"an evolutionary force that causes a particular phenotype to be more favorable in certain environmental conditions"},{"snt_id":"G17.2_2012719958_6","term":"maximally entangled","difficulty":1.0,"definition":"A maximally entangled state is a state that maximises some entanglement measure."},{"snt_id":"T19.1_2041007121_6","term":"Application-Layer Traffic Optimization","difficulty":2.0,"definition":"Application Layer Transport Optimization (ALTO) is a protocol that allows internet clients to obtain information that compares the network properties of paths to other endpoints."},{"snt_id":"G07.2_1917985537_3","term":"temporal biases","difficulty":1.0,"definition":"Temporal bias is the unbalanced collecting of specimens in some years or parts of the year"},{"snt_id":"G17.1_2962706423_2","term":"quantum processing units","difficulty":2.0,"definition":"A quantum processing units (QPU), aka a quantum processor, is the brain of a quantum computer that uses the behavior of particles like electrons or photons to make certain kinds of calculations much faster than processors in today’s computers."},{"snt_id":"G14.2_2088744588_7","term":"topology","difficulty":1.0,"definition":"In a mesh topology, in contrast to the tree topology, there are no hierarchical relationships. Any device in a mesh topology is allowed to attempt to contact any other device either directly or by taking advantage of routing-capable devices to relay the message on behalf of the message originator"},{"snt_id":"G07.2_1887815499_2","term":"information string","difficulty":1.0,"definition":"information strings represent communications of any sort, from signals issued by machines to messages exchanged between workers to orders and directives from superiors to subordinates."},{"snt_id":"G17.1_2480433103_1","term":"superposition","difficulty":1.0,"definition":"The superposition of state is the first fundamental attribute of quantum systems, which enable the quantum computer to perform parallel computation on a huge scale."},{"snt_id":"T19.2_1543999319_5","term":"hyperplane tile coding","difficulty":2.0,"definition":"Tile coding is a form of coarse coding that is particularly well suited for use on sequential digital computers and for efficient online learning"},{"snt_id":"T15.2_2412345753_3","term":"Hyper-jacking","difficulty":2.0,"definition":"Hyperjacking is an attack in which a hacker takes malicious control over the hypervisor that creates the virtual environment within a virtual machine (VM) host."},{"snt_id":"T19.2_2125861761_1","term":"classifier systems","difficulty":1.0,"definition":"Classification is the process of identifying which category a new observation belongs to based on a training data set containing observations whose category membership is known"}]